Repository: zipf/perldoc-es
Catalog: memory/clean/omegat_clean_prj-level2.tmx
Source language: en_us
Languages: es

source: Note that if this operator is used and NOT inside of an alternation then it acts exactly like the C<(*PRUNE)> operator.
es: Tenga en cuenta que, si se usa este operador, y NO está dentro de una alternancia, entonces actúa exactamente igual que el operador C<(*PRUNE)>.

source: Note that just because a hash is initialized in that order doesn't mean that it comes out in that order.
es: Tenga en cuenta que aunque un hash se inicialice en ese orden, sus valores no tienen por qué salir en el mismo orden.

source: Note that not all modules will work with on all platforms.
es: Tenga en cuenta que no todos los módulos funcionarán en todas las plataformas.

source: Note that since Perl 5.8.1 the single-number v-strings (like C) are not v-strings before the C<< => >> operator (which is usually used to separate a hash key from a hash value); instead they are interpreted as literal strings ('v65').
es: También debe tener en cuenta que, desde la versión Perl 5.8.1, las cadenas v-string de un solo número (como C) no son v-strings delante del operador C<< => >> (que se utiliza normalmente para separar una clave hash de un valor hash), sino que se interpretan como cadenas literales ('v65').

source: Note that some declarations also function as statements.
es: Tenga en cuenta que algunas declaraciones también funcionan como instrucciones.

source: Note that some modules in this directory may not yet have been released separately on CPAN.
es: Tenga en cuenta que es posible que algunos de los módulos de este directorio aún no se hayan publicado por separado en CPAN.

source: Note that the C<a>, C<d>, C<l>, C<p>, and C<u> modifiers are special in that they can only be enabled, not disabled, and the C<a>, C<d>, C<l>, and C<u> modifiers are mutually exclusive: specifying one de-specifies the others, and a maximum of one (or two C<a>'s) may appear in the construct.
es: Tenga en cuenta que los modificadores C<a>, C<d>, C<l>, C<p> y C<u> son especiales, en el sentido de que solo se pueden habilitar (no se pueden deshabilitar), y los modificadores C<a>, C<d>, C<l> y C<u> son mutuamente excluyentes: si se especifica uno, se anula la especificación de los demás, y no puede haber más de uno (o dos C<a>) en la construcción.

source: Note that the PerlIO equivalents of C<fread> and C<fwrite> are slightly different from their C library counterparts:
es: Tenga en cuenta que en PerlIO las funciones equivalentes a C<fread> y C<fwrite> son ligeramente distintas de sus homólogas de la biblioteca de C:

source: Note that the braces are required in Perl, even if you've only got one line in the block.
es: Tenga en cuenta que en Perl es obligatorio usar las llaves, aunque sólo haya una línea en el bloque.

source: Note that the counting for relative recursion differs from that of relative backreferences, in that with recursion unclosed groups B<are> included.
es: Tenga en cuenta que el recuento de la recursión relativa difiere del de retrorreferencias relativas en que con la recursión B<se incluyen> grupos no cerrados.

source: Note that the rule for zero-length matches (see L</"Repeated Patterns Matching a Zero-length Substring">) is modified somewhat, in that contents to the left of C<\G> are not counted when determining the length of the match.
es: Tenga en cuenta que la norma para las coincidencias de tamaño cero (vea L</"Patrones repetidos que coinciden con subcadenas de longitud cero">) se ha modificado algo, puesto que el contenido a la izquierda de C<\G> no se tiene en cuenta para determinar la longitud de la coincidencia.

source: Note that the value of an actual array in scalar context is the length of the array; the following assigns the value 3 to $foo:
es: Tenga en cuenta que el valor de un array en contexto de escalar es la longitud del array; la línea siguiente asigna el valor 3 a $foo:

source: Note that there's nothing wrong with defining multiple subclasses of a given class.
es: No hay nada malo en definir múltiples subclases de una clase.

source: Note that this means that the contents of capture groups defined inside an eval'ed pattern are not available outside of the pattern, and vice versa, there is no way for the inner pattern returned from the code block to refer to a capture group defined outside.
es: Tenga en cuenta que esto significa que el contenido de los grupos de captura definidos dentro de un patrón evaluado no están disponibles fuera del patrón, y viceversa; no hay manera de que el patrón interno devuelto por un bloque de código haga referencia a un grupo de captura definido fuera.

source: Note that this variable was added in Perl 5.14.0.
es: Esta variable se incorporó en Perl 5.14.0.

source: Note that using the v-strings for IPv4 addresses is not portable unless you also use the inet_aton()/inet_ntoa() routines of the Socket package.
es: Tenga en cuenta que el uso de v-strings para las direcciones IPv4 no es portable a menos que también utilice las rutinas inet_aton()/inet_ntoa() del paquete Socket.

source: Note that you cannot read from the DATA filehandle in a BEGIN block: the BEGIN block is executed as soon as it is seen (during compilation), at which point the corresponding __DATA__ (or __END__) token has not yet been seen.
es: Tenga en cuenta que no puede leer el identificador de archivo DATA en un bloque BEGIN: el bloque BEGIN se ejecutará tan pronto como se encuentre (durante la compilación), momento en que aún no se ha visto el símbolo __DATA__ (o __END__) correspondiente.

source: Note that you have to be careful not to include the pattern delimiter in the comment--perl has no way of knowing you did not intend to close the pattern early.
es: Debe tener cuidado para no incluir el delimitador de patrón en el comentario: perl no puede adivinar que no pretendía cerrar el patrón en ese punto.

source: Note, however, that (unlike most other OO languages) Perl does not ensure or enforce encapsulation in any way.
es: Tenga en cuenta, sin embargo, que (al contrario de lo que ocurre en otros lenguajes de orientación a objetos) no se asegura ni se fuerza la encapsulación en modo alguno.

source: Notice also the C<grok_bin>, C<grok_hex>, and C<grok_oct> functions in F<numeric.c> for converting strings representing numbers in the respective bases into C<NV>s.
es: También están disponibles las funciones C<grok_bin>, C<grok_hex> y C<grok_oct> de F<numeric.c> para convertir cadenas que representan números en sus respectivas bases en valores C<NV>.

source: Notice that "hello" is only printed once, as when Perl sees that the sixth iteration of the outermost C<(?:)*> matches a zero-length string, it stops the C<*>.
es: Tenga en cuenta que "hola" sólo se imprime una vez, ya que cuando Perl ve que la sexta iteración de la construcción C<(?:)*> más exterior coincide con una cadena de longitud cero, detiene al cuantificador C<*>.

source: Notice the different order of arguments to C<Copy> and C<Move> than used in C<memcpy> and C<memmove>.
es: Observe que el orden de los argumentos de C<Copy> y C<Move> es distinto del de los argumentos de C<memcpy> y C<memmove>.

source: Now C<use customre> enables the new escape in constant regular expressions, i.e., those without any runtime variable interpolations.
es: Ahora C<use rxpersonal> permite usar el nuevo escape en expresiones regulares constantes, es decir, aquellas que no realizan interpolación de variables en tiempo de ejecución.

source: Now commit your change locally:
es: Ahora confirme el cambio localmente:

source: Now if we see a C<U> which was at the start of the string, we turn on the C flag for the output SV, C<cat>:
es: Ahora bien, si vemos una C<U> al principio de la cadena, activamos la marca C para el SV de salida, C<cat>:

source: Now it's barely a skeleton as its whitewashed bones have fractured or eroded.
es: Ahora, sus huesos pelados, rotos o erosionados, solo se asemejan vagamente a un esqueleto.

source: Now let's look over C<pp_pack>: we take a pattern into C<pat>, and then loop over the pattern, taking each format character in turn into C<datum_type>.
es: Echemos un vistazo a C<pp_pack>: tenemos un patrón en C<pat> y un bucle que recorre el patrón y pasa de uno en uno los caracteres de formato a C<datum_type>.

source: Now often called C<open source software>.
es: Ahora se suele llamar C<software open source>.

source: Now that "script" and "scripting" are terms that have been seized by unscrupulous or unknowing marketeers for their own nefarious purposes, they have begun to take on strange and often pejorative meanings, like "non serious" or "not real programming".
es: Ahora que mercaderes sin escrúpulos ni conocimientos se han apropiado de los términos "script" y "scripting" para sus viles propósitos, se les ha empezado a asociar significados extraños, generalmente peyorativos, como "programación poco seria" o "programación menor".

source: Now that we have everything up to date, we need to create a temporary new branch for these changes and switch into it:
es: Ahora que está todo actualizado, tenemos que crear una nueva rama temporal para estos cambios y cambiar a dicha rama:

source: Now that we have the C<*foo{THING}> notation, typeglobs aren't used as much for filehandle manipulations, although they're still needed to pass brand new file and directory handles into or out of functions.
es: Ahora que tenemos la notación C<*foo{COSA}> ya no se usan tanto los typeglobs para la manipulación de identificadores de archivo, aunque siguen siendo necesarios para pasar identificadores de archivo y de directorio a (o desde) funciones.

source: Now there's indeed something following "AB" that is not "123".
es: Ahora hay algo después de "AB" que no es "123".

source: Now we can add our tests to the end.
es: Ahora podemos agregar nuestras pruebas al final.

source: Now we can inspect the change:
es: Ahora podemos inspeccionar el cambio:

source: Now we can use the subroutine just as any other built-in function:
es: Ahora podemos usar la subrutina como cualquier función predefinida:

source: Now we must do two additional things before this patch is ready to go: we've changed the behaviour of Perl, and so we must document that change.
es: Ahora tenemos que hacer dos cosas más para terminar de preparar el parche: hemos cambiado el comportamiento de Perl, por lo que debemos documentar el cambio.

source: Now we'll test that we got that space-at-the-beginning business right:
es: Ahora comprobamos que la comprobación de espacio inicial es correcta:

source: Now you can see the differences between the branch and blead:
es: Ahora puede ver las diferencias entre la rama y blead:

source: Now you cannot alter C<$PI>, which is probably a good thing all in all.
es: Ahora no puede modificar C<$PI>, lo que probablemente no sea mala idea.

source: Now you should create a patch file for all your local changes:
es: Ahora debe crear un parche para todos los cambios locales:

source: Now you're ready to build:
es: Ya está listo para compilar:

source: Now, a typo in a quantifier silently causes it to be treated as the literal characters.
es: Actualmente, un error tipográfico en un cuantificador, hace que se trate igual que si fueran caracteres literales sin emitir ninguna advertencia.

source: Now, quite a few people have the Acme Transmogrifier, and you've had to write something to talk the protocol from scratch - you'd almost certainly want to make that into a module.
es: Hay muchos usuarios de Acme Transmogrifier y ha tenido que partir de cero para escribir el código de comunicación del protocolo. Con toda seguridad, este código podría ser un buen candidato a módulo.

source: Nowadays it can refer to almost anything.
es: Actualmente se puede referir casi a cualquier cosa.

source: Nowadays, there are several good choices on CPAN for using roles.
es: Actualmente ya existen varias opciones buenas en CPAN para usar roles.

source: Numbers don't need quotes around them:
es: No es necesario escribir los números entre comillas:

source: Numeric literals are specified in any of the following floating point or integer formats:
es: Los literales numéricos se especifican en cualquiera de los siguientes formatos de punto flotante o entero:

source: OO Perl is relatively simple and is implemented using references which know what sort of object they are based on Perl's concept of packages.
es: La programación orientada a objetos en Perl es relativamente sencilla y se implementa con referencias que "conocen" qué tipo de objeto son, basándose en el concepto de paquetes de Perl.

source: OPERATOR PRECEDENCE = = perldoc.perl.org
es: PRECEDENCIA OP. = = perldoc.perl.org

source: Object Orientation is not the best solution to every problem.
es: La orientación a objetos no es la mejor solución para todos los problemas.

source: Objects are merely Perl data structures (hashes, arrays, scalars, filehandles, etc.) that have been explicitly associated with a particular class.
es: Los objetos son simplemente estructuras de datos (hashes, arrays, escalares, identificadores de archivos, etc.) que se han asociado explícitamente a una clase concreta.

source: Octal constants in Perl start with 0, as in 013.
es: Las constantes octales en Perl empiezan por 0 (p. ej., 013).

source: Oddly enough, Platonic classes don't always have Platonic relationships--see L</inheritance>.
es: Sorprendentemente, las clases platónicas no siempre tienen relaciones platónicas (vea L</herencia>).

source: Of course, Perl has its internal encoding to store the string in memory, but ignore that.
es: Por supuesto, Perl utiliza su propia codificación para almacenar la cadena en memoria, pero el usuario no tiene que conocer los detalles.

source: Of course, C<Moose> isn't perfect.
es: Por supuesto, C<Moose> no es perfecto.

source: Of course, if the child thread needs to make use of the objects, then a more sophisticated approach is needed.
es: Si el hilo derivado tuviera que usar los objetos, sería necesario un enfoque más sofisticado.

source: Of course, if the class name is in a scalar Perl will do the right thing as well:
es: Por supuesto, si el nombre de la clase está almacenado en una variable escalar, Perl también hará lo correcto:

source: Of course, it'll need to be executable first, so C<chmod 755 script.pl> (under Unix).
es: Por supuesto, antes deberá marcarlo como ejecutable con el comando C<chmod 755 script.pl> (en Unix).

source: Often considered superior to big-endian machines.
es: Estos equipos se suelen considerar superiores a los equipos big-endian.

source: Often considered superior to little-endian machines.
es: Estos equipos se suelen considerar superiores a los equipos I<little-endian>.

source: Often done with an incoming L</pipe>.
es: Estos datos suelen llegar a través de una L</tubería>.

source: Often just called a "lexical".
es: En inglés se suele llamar simplemente "lexical".

source: Often used metaphorically to indicate a transfer of programmatic control to a destination selected algorithmically, often by lookup in a table of function L<references|/reference> or, in the case of object L<methods|/method>, by traversing the inheritance tree looking for the most specific definition for the method.
es: Normalmente se usa como metáfora para indicar una transferencia del control del programa a un destino seleccionado algorítmicamente, normalmente buscando en una tabla de L<referencias|/referencia> de función o, en el caso de L<métodos|/método> de objeto, recorriendo el árbol de herencia en busca de la definición más específica del método.

source: Often used in the context of L</file> or L</process> ownership.
es: Se suele usar en el contexto de propiedad de un L</archivo> o L</proceso>.

source: Often used loosely to describe the lowest 128 values of the various ISO-8859-X character sets, a bunch of mutually incompatible 8-bit codes sometimes described as half ASCII.
es: Se suele usar de manera informal para describir los primeros 128 valores de los distintos juegos de caracteres ISO-8859-X, un conjunto de códigos de 8 bits mutuamente incompatibles que a veces se describen como la mitad de ASCII.

source: Often used more specifically to mean the sort of name you might find in a L</symbol table>.
es: Se suele usar de manera más específica para designar el tipo de nombre que se puede encontrar en una L</tabla de símbolos>.

source: Often used specifically to mean a L</zero width> assertion.
es: Se suele usar específicamente para hacer referencia a una aserción de L</ancho cero>.

source: Often used to illustrate a particular Perl feature, and something of an ongoing Obfuscated Perl Contest seen in Usenix signatures.
es: Se suele usar para ilustrar una característica determinada de Perl, y se viene usando de forma continuada en las firmas de Usenix, como si de un concurso de Perl ofuscado se tratara.

source: Often used to pick interesting tidbits out of a file.
es: Se suele usar para seleccionar fragmentos interesantes de un archivo.

source: Often, you'll need to be root.
es: Normalmente necesitará privilegios de usuario raíz.

source: Oh, you weren't talking ASCII?
es: ¡Ah, no se refería a ASCII!

source: Okay, if you insist: the "internal format" is utf8, not UTF-8.
es: Bueno, ya que insiste: el "formato interno" es utf8, no UTF-8

source: Okay, that's I<definitely> enough hype.
es: Entre otras...

source: Older documentation (and some CPAN modules) encouraged this syntax, particularly for constructors, so you may still find it in the wild.
es: Versiones anteriores de la documentación (y algunos módulos de CPAN) recomendaban el uso de esta sintaxis, especialmente para los constructores, de forma que aún pueden encontrarse ejemplos.

source: Older threaded Perls (5.8.6 or earlier) will run into this problem.
es: pero afecta a las versiones antiguas (5.8.6 o anteriores) que se hayan compilado con compatibilidad con hilos de ejecución.

source: Omit redundant punctuation as long as clarity doesn't suffer.
es: Omitir la puntuación redundante mientras se entienda bien el código.

source: On ASCII platforms, this means that the code points between 128 and 255 take on their Latin-1 (ISO-8859-1) meanings (which are the same as Unicode's).
es: En plataformas ASCII, esto significa que los códigos de carácter entre 128 y 255 se usan como si fueran Latin-1 (ISO-8859-1) (que son los mismos que en Unicode).

source: On ASCII platforms, the native rules are ASCII, and on EBCDIC platforms (at least the ones that Perl handles), they are Latin-1.
es: En plataformas ASCII, las reglas nativas son las de ASCII, y en plataformas EBCDIC (al menos en las compatibles con Perl) son las de Latin-1.

source: On EBCDIC platforms, this may be different even.
es: En plataformas EBCDIC la codificación puede ser distinta a las mencionadas.

source: On FreeBSD the full path of the perl interpreter is found by using C<sysctl> with C<KERN_PROC_PATHNAME> if that is supported, else by reading the symlink F</proc/curproc/file>.
es: En FreeBSD, la ruta completa del intérprete perl se obtiene mediante C<sysctl> con C<KERN_PROC_PATHNAME>, si se admite; de lo contrario, se puede leer el vínculo simbólico F</proc/curproc/file>.

source: On Unix systems, the L</root> user.
es: En sistemas Unix, el usuario L</root>.

source: On Unix systems, this status value is the same as the status word returned by I<wait>(2).
es: En sistemas Unix, este valor de estado es el mismo que la palabra de estado devuelta por I<wait>(2).

source: On Unix systems, you can check the I<ls>(1) manpage for more information.
es: En sistemas Unix puede consultar la página de manual I<ls>(1) para obtener más información.

source: On Windows systems, usually the Administrator user.
es: En sistemas Windows, generalmente el usuario Administrador.

source: On a Unix system, the name is often placed into C<$ENV{HOME}> or C<$ENV{LOGDIR}> by I<login>, but you can also find it with C<(getpwuid($E<lt>))[7]>.
es: En un sistema Unix, el I<inicio de sesión> suele colocar el nombre en C<$ENV{HOME}> o en C<$ENV{LOGDIR}>, pero también puede encontrarlo con C<(getpwuid($E<lt>))[7]>.

source: On a Unix-like system, these documentation files will usually also be available as manpages for use with the F<man> program.
es: En un sistema Unix, esta documentación estará también disponible, por lo general, en forma de páginas de manual que se pueden consultar con el programa F<man>.

source: On a binary string, you would do things like:
es: Con una cadena binaria puede realizar operaciones como estas:

source: On a successful match, the C<$REGERROR> variable will be set to FALSE, and the C<$REGMARK> variable will be set to the name of the last C<(*MARK:NAME)> pattern executed.
es: Si hay coincidencia, se establece la variable C<$REGERROR> en FALSE y la variable C<$REGMARK> en el nombre del último patrón C<(*MARK:NOMBRE)> ejecutado.

source: On a text string, you would do things like:
es: Con una cadena de texto puede realizar operaciones como estas:

source: On failure, the C<$REGERROR> variable will be set to the ARG value of the verb pattern, if the verb was involved in the failure of the match.
es: En caso de error, se establecerá como valor de la variable C<$REGERROR> el valor de ARG del patrón de verbo, si el verbo está involucrado en el error de coincidencia.

source: On non-Unix machines, this is emulated by the C library even if the underlying L</operating system> has different ideas.
es: En equipos que no usan Unix esto se emula mediante la biblioteca de C, aunque el L</sistema operativo> subyacente tenga ideas distintas.

source: On return, the reference will overwrite the hash slot in the symbol table specified by the *some_hash typeglob.
es: Al volver, la referencia reemplazará la ubicación de hash ocupada en la tabla de símbolos especificada por el typeglob *mi_hash.

source: On simple groups, such as the pattern C<< (?> [^()]+ ) >>, a comparable effect may be achieved by negative look-ahead, as in C<[^()]+ (?!
es: En grupos sencillos, como en el patrón C<< (?> [^()]+ ) >>, se puede conseguir un efecto comparable por medio de una aserción de inspección hacia adelante, como en C<[^()]+ (?!

source: On some machines, well-known services are listed by the L<getservent|perlfunc/getservent> function.
es: En algunos equipos, la función L<getservent|perlfunc/getservent> muestra los servicios conocidos.

source: On the EBCDIC platforms that Perl handles, the native character set is equivalent to Latin-1.
es: En las plataformas EBCDIC compatibles con Perl, el juego de caracteres nativo es equivalente a Latin-1.

source: On the other hand
es: Por otra parte,

source: On the other hand, the leading symbol ('$' or '@') on the array or hash indicates whether you are getting back a singular value (a scalar) or a plural one (a list).
es: Por otra parte, el símbolo inicial ('$' o '@') del nombre del array o hash indica si se va a obtener un solo valor (un escalar) o varios (una lista).

source: On typical hardware, floating point values can store numbers with up to 53 binary digits, and with binary exponents between -1024 and 1024.
es: En el hardware típico, los valores de punto flotante pueden almacenar números que tengan hasta 53 dígitos binarios, y con exponentes binarios entre -1024 y 1024.

source: Once those changes are applied and released, the new version of the module will be incorporated into the core.
es: Cuando se hayan aplicado y publicado estos cambios, la nueva versión del módulo se incorporará al núcleo.

source: Once a C<BEGIN> has run, it is immediately undefined and any code it used is returned to Perl's memory pool.
es: Una vez ejecutado el bloque C<BEGIN>, pasa a estar no definido y el código usado se devuelve al banco de memoria de Perl.
